
class _2551
{
    static _612()
    {
        let _1902;
        _1902 = parent._585;

        let _824;
        _824 = "";
        _824 += "<div style='text-align:center; width:100%;'>\r\n";
        _824 += "   <span id='_2805' style='display: inline-block; text-align: left; '>\r\n";
        _824 += "       <div style='text-align: left; text-indent: 2em; display: inline-block;'>\r\n";
        _824 += "           " + L("在这里，手动编辑节拍的时间，机器会根据这些信息，自动谱曲。") + "\r\n";
        _824 += "       </div>\r\n";
        _824 += "       <div style='text-align: left; text-indent: 2em; display: inline-block;'>\r\n";
        _824 += "           " + L("根据作者对流行歌曲的分析，节拍再也不是传统的2/4拍、3/4拍的概念，而是大体和单词对应。") + "\r\n";
        _824 += "           " + L("单词的第一个音节重，其余的轻。") + "\r\n";
        _824 += "           " + L("也有单个音节的单词，合成一个接拍的。也有一个单词拆成两个节拍的（不提倡）。") + "\r\n";
        _824 += "           " + L("一般来说，一个节拍有两个音节，也有三个音节或者一个音节的时候。") + "\r\n";
        _824 += "           " + L("这里是人声的节拍，和背景音乐的beat，并不一致。") + "\r\n";
        _824 += "       </div>\r\n";
        _824 += "       <div style='text-align: left; text-indent: 2em; display: inline-block;'>\r\n";
        _824 += "           " + L("节拍的音节可以有不同的时值，他们是：") + "\r\n";
        _824 += "       </div>\r\n";
        _824 += "       <ul style='margin-bottom: 0px; margin-top: 0px;'>\r\n";
        _824 += "           <li>" + L("半拍、一道减时线、八分之一音符、♪，这是最常见的情况。：") + "<span style='background-color: rgba(0 255 255 / 0.2);'>" + L("咚呛") + "</span>" + "</li>\r\n";
        _824 += "           <li>" + L("一拍、没有减时线、四分之一音符、♩：") + "<span style='background-color: rgba(0 255 0 / 0.15);'>" + L("咚呛") + "</span>" + "</li>\r\n";
        _824 += "           <li>" + L("四分之一拍、两道减时线、十六分音符、♬：") + "<span style='background-color: rgba(0 0 255 / 0.1);'>" + L("咚呛") + "</span>" + "</li>\r\n";
        _824 += "       </ul>\r\n";
        _824 += "   </span><br/><br/><br/>\r\n"

        _824 += "<div id='_2807' style='text-align: center; font-size:20px;font-weight: lighter; text-align: left; white-space: nowrap; display: inline-block;'>\r\n";
        _824 += "<span style='text-align: right; display: inline-block; text-align: center; position: relative; top: 12px;'>\r\n";
        for (let _620 = 0; _620 < _1902.length; _620++)
        {
            let _445;
            _445 = _1902[_620];
            if (_445._1137)
                continue;
            let _270;
            _270 = _445._1138;
            let _2133;
            _2133 = _1141._1654(_445);
            let _2161;
            _2161 = _1141._2162(_2133);
            _824 += "<span id='_7634" + _620 + "' style='display: inline-block; white-space: nowrap;'>";
            for (let _2283 = 0; _2283 < _2161; _2283++)
            {
                let _2743, _2685;
                [_2743, _2685] = _1141._2282(_2133, _2283);
                let _2744, _2745;
                _2744 = "";
                for (let _1656 = _2743; _1656 <= _2685; _1656++)
                {
                    _2744 += "<span id='_7635" + _620 + "_" + _1656 + "'>";
                    let _2262;
                    _2262 = _2133[_1656];
                    let _358;
                    _358 = _2262._1657;
                    _2744 += _358._1640;
                    _2744 += _358._1688();
                    if (_1656 == _2685)
                    {
                        let _2746;
                        let _2747;
                        _2746 = _2748._2749(_2133, _1656, '_7752', eval(_1410("_2747")));
                        if ((!_2746) || _2747)
                        {
                            _2745 = " ";
                            if (_2747)
                                _2744 += _2746;
                        }
                        else
                        {
                            _2745 = _2746;
                        }
                    }
                    _2744 += "</span>";
                }
                let _270;
                _270 = _2133[_2685]._2317;
                let _2803, _1962;
                switch (_270._2804)
                {
                    case F("半拍"): _2803 = "0 255 255 / 0.2"; _1962 = L("半拍"); break;
                    case F("一拍"): _2803 = "0 255 0 / 0.15"; _1962 = L("一拍"); break;
                    case F("四分之一拍"): _2803 = "0 0 255 / 0.1"; _1962 = L("四分之一拍"); break;
                }
                _1962 += L("（点击切换，其他时值）");
                _824 += "<span id='_7633" + (_620 + "_" + _2283) + "' title='" + _1962 + "' style='background-color: rgba(" + _2803 + "); cursor: pointer;' onclick='_2551._2808(" + _620 + "," + _2283 +");'>";
                _824 += _2744;
                _824 += "</span>\r\n";
                _824 += _2745;
            }
            _824 += "</span><br/>\r\n";
            _824 += _2552._2734(_1902, _620);
        }
        _824 += "</span>\r\n";
        _824 += _2552._2738(_1902);
        _824 += _1938._2050();
        _824 += "</div><br/><br/>\r\n";

        _824 += "   <span id='_2806' style='display: inline-block; text-align: left; '>\r\n";
        _824 += "       <div style='text-align: left; display: inline-block;'>\r\n";
        _824 += "          "+L("节拍时间的建议有：") + "\r\n";
        _824 += "       </div>\r\n";
        _824 += "       <ul style='margin-bottom: 0px; margin-top: 0px;'>\r\n";
        _824 += "           <li>";
        _824 += "               " + L("一句话内相邻的三个节拍时间不能相同。提倡尽量都不相同。") + "\r\n"; 
        _824 += "               <span style='cursor: pointer; color: blue; text-decoration: underline; white-space: nowrap;' onclick='_2551._2809();'>" + L("检测") + "</span>";
        _824 += "           </li>\r\n";
        _824 += "           <li>\r\n";
        _824 += "               " + L("不同的句子，节拍时间方式要有规律的循环。") + "\r\n";
        _824 += "           </li>\r\n";
        _824 += "       </ul>\r\n";
        _824 += "   </span><br/><br/><br/>\r\n"
        _824 += "</div>\r\n";
        _1906(_824);
        _1907(_2805,_2806, _2807);
        _2552._2079("_7634", "_7635", _1902, -6);
    }

    static _2808(_620, _2283)
    {
        let _1902;
        _1902 = parent._585;
        let _445;
        _445 = _1902[_620];
        let _2133;
        _2133 = _1141._1654(_445);
        let _270;
        _270 = _1141._2648(_2133, _2283);
        switch (_270._2804)
        {
            case F("半拍"): _270._2804 = F("一拍"); break;
            case F("一拍"): _270._2804 = F("四分之一拍"); break;
            case F("四分之一拍"): _270._2804 = F("半拍"); break;
        }
        _1141._1659(_445, _2133);
        _2551._612()
    }
    static _261()
    {
        _2552._261();
    }
    static _2809()
    {
        let _2030;
        _2030 = false;
        let _1902;
        _1902 = parent._585;
        for (let _620 = 0; _620 < _1902.length; _620++)
        {
            let _445;
            _445 = _1902[_620];
            if (_445._1137)
                continue;
            let _2133;
            _2133 = _1141._1654(_445);
            let _2161;
            _2161 = _1141._2162(_2133);
            let _2810;
            _2810 = "";
            let _2811;
            _2811 = -1;
            let _2790;
            function _2791()
            {
                let _2812;
                _2812 = _2790 - 1;
                let _2813;
                _2813 = _2812 - _2811 +1;
                let _2794;
                
                
                
                
                
                
                {
                    if (_2813 >= 3)
                        _2794 = true;
                }
                if (_2794)
                {
                    _2552._2753(_620, _2811, _2812, L("这") + _2813 + L("个节拍拥有相同的持续时长，建议修改。"));
                    _2030 = true;
                }
            }
            for (_2790 = 0; _2790 < _2161; _2790++)
            {
                let _270;
                _270 = _1141._2648(_2133, _2790);
                let _2814;
                _2814 = _270._2804;
                if (_2814 != _2810)
                {
                    if (_2810 != "")
                        _2791();
                    _2811 = _2790;
                    _2810 = _2814;
                }
            }
            if (_2811 != _2161 - 1)
                _2791();
        }
        if (!_2030)
            _2031();
    }

    static _2815(_2055, _2056, _1983, _2057, _2058, _2283, _2816)
    {
        let _2409, _2410;
        [_2409, _2410] = _2189._2284(_2056, _2283);

        let _2053;
        _2053 = _2410 - _2409 + 1;

        let _2795, _2796;
        _2795 = _2056._2154(_2409);
        _2796 = _2056._2154(_2410);

        if (_2053 <= 2)
        {
            for (let _1656 = _2409; _1656 <= _2410; _1656++)
            {
                let _333;
                _333 = _2056._2154(_1656);
                _333._2065(_2816);
            }
        }
        else if (_2053 == 3)
        {
            for (let _1656 = _2410 - 1; _1656 <= _2410; _1656++)
            {
                let _333;
                _333 = _2056._2154(_1656);
                _333._2065(_2816);
            }
        }
    }
    static _1626(_2055, _2056, _1983, _2057, _2058)
    {
        let _2161;
        _2161 = _2189._2161(_2056);
        for (let _2283 = 0; _2283 < _2161; _2283++)
        {
            let _270;
            _270 = _2056._2286(_2283);
            let _2816;
            switch (_270._2804)
            {
                case F("半拍"): _2816 = 0.5; break;
                case F("一拍"): _2816 = 1; break;
                case F("四分之一拍"): _2816 = 0.25; break;
            }
            _2551._2815(_2055, _2056, _1983, _2057, _2058, _2283, _2816);
        }
    }
}
