


function _1104(_2849,_1232,_6099,_6100,_6101)
{
	let _824;
	_824="<span style='vertical-align:top;'>"+_1232+"</span>\r\n";
	_824+="<span style='display:inline-block;text-align:right;'>\r\n";
	_824+="  <select></select>\r\n";
	if(_6100)
		"<br />\r\n";
	_824+="  <input type='button' value='"+L("试听")+"' onclick='_6108(this);' />\r\n";
	if(_6099)
		_824+="  <span></span>\r\n";
	_824+="</span>\r\n";
	_2849.innerHTML = _824;
	let _406, _6102, _366;
	_406 = _2849.getElementsByTagName("input")[0];
	_6102 = _2849.getElementsByTagName("select")[0];
	if (_6099)
		_366 = _2849.getElementsByTagName("span")[2];
	_2849._6103 = function ()
	{
		return _406;
	}
	_2849._6103()._2849 = _2849;
	_2849._1107 = function ()
	{
		return _6102;
	}
	_2849._1151 = function (_1291)
	{
		let _6104;
		_6104 = this._1107();
		if (!_1291)
		{
			_6104.selectedIndex = 0;
			return;
		}
		_6104.value = _1291;
    }
	_2849._6105 = function (_1291)
	{
		return this._1107().value;
	}
	_2849._1105 = function (_6106,_6107)
	{
		this._1107().onchange = function () { _6106(_6107); };
	}
	_2849._6108 = function ()
	{
		_6109(this._1107().value);
	}
	_2849._6110 = function ()
	{
		return _366;
	};
	_2849._6111 = function ()
	{
		let _6104;
		_6104 = this._6110();
		return _6104.value;
	};
	_2849._5677 = function (_984)
	{
		let _6104;
		_6104 = this._6110();
		_6104._837(_984);
	};
	_2849._582 = function (_582)
	{
		this._1107().disabled = !_582;
		this._6103().disabled = !_582;
		let _366;
		_366 = this._6110();
		if (_366)
			_366._967(_582);
	};
	if(_6099)
	{
		let _984;
		_984 = _2849._6110();
		_1074(_984, 0, 1, null, 120, 18);
		_984._1077(true);
		_984._837(1);
	}
	let select;
	select = _2849._1107();
	select._3289="_7859";
	select.options.length=0;
	select.onchange=function()
	{
		_6108(select);
		if(parent)
			parent._1841();
	};
	{
		function _738(value,_1267)
		{
			_1267=_6112+" - "+_1267;
			let _1108=new Option(_1267,value);
			select.options.add(_1108);
		}
		let _6112;
		_6112=L("钢琴");
		_738(0,L("大钢琴（声学钢琴）"));
		_738(1,L("明亮的钢琴"));
		_738(2,L("电钢琴"));
		_738(3,L("酒吧钢琴"));
		_738(4,L("柔和的电钢琴"));
		_738(5,L("加合唱效果的电钢琴"));
		_738(6,L("羽管键琴（拨弦古钢琴）"));
		_738(7,L("科拉维科特琴（击弦古钢琴）"));

		_6112=L("色彩打击乐器");
		_738(8,L("钢片琴"));
		_738(9,L("钟琴"));
		_738(10,L("八音盒"));
		_738(11,L("颤音琴"));
		_738(12,L("马林巴"));
		_738(13,L("木琴"));
		_738(14,L("管钟"));
		_738(15,L("大扬琴"));

		_6112=L("风琴");
		_738(16,L("击杆风琴"));
		_738(17,L("打击式风琴"));
		_738(18,L("摇滚风琴"));
		_738(19,L("教堂风琴"));
		_738(20,L("簧管风琴"));
		_738(21,L("手风琴"));
		_738(22,L("口琴"));
		_738(23,L("探戈手风琴"));

		_6112=L("吉他");
		_738(24,L("尼龙弦吉他"));
		_738(25,L("钢弦吉他"));
		_738(26,L("爵士电吉他"));
		_738(27,L("清音电吉他"));
		_738(28,L("闷音电吉他"));
		_738(29,L("加驱动效果的电吉他"));
		_738(30,L("加失真效果的电吉他"));
		_738(31,L("吉他和音"));


		_6112=L("贝司");
		_738(32,L("大贝司（声学贝司）"));
		_738(33,L("电贝司（指弹）"));
		_738(34,L("电贝司（拨片）"));
		_738(35,L("无品贝司"));
		_738(36,L("掌击贝司 1"));
		_738(37,L("掌击贝司 2"));
		_738(38,L("电子合成贝司 1"));
		_738(39,L("电子合成贝司 2"));


		_6112=L("弦乐");
		_738(40,L("小提琴"));
		_738(41,L("中提琴"));
		_738(42,L("大提琴"));
		_738(43,L("低音大提琴"));
		_738(44,L("弦乐群颤音音色"));
		_738(45,L("弦乐群拨弦音色"));
		_738(46,L("竖琴"));
		_738(47,L("定音鼓"));


		_6112=L("合奏/合唱");
		_738(48,L("弦乐合奏音色1"));
		_738(49,L("弦乐合奏音色2"));
		_738(50,L("合成弦乐合奏音色1"));
		_738(51,L("合成弦乐合奏音色2"));
		_738(52,L("人声合唱“啊”"));
		_738(53,L("人声“嘟”"));
		_738(54,L("合成人声"));
		_738(55,L("管弦乐敲击齐奏"));


		_6112=L("铜管");
		_738(56,L("小号"));
		_738(57,L("长号"));
		_738(58,L("大号"));
		_738(59,L("加弱音器小号"));
		_738(60,L("法国号（圆号）"));
		_738(61,L("铜管组（铜管乐器合奏音色）"));
		_738(62,L("合成铜管音色1"));
		_738(63,L("合成铜管音色2"));


		_6112=L("簧管");
		_738(64,L("高音萨克斯风"));
		_738(65,L("次中音萨克斯风"));
		_738(66,L("中音萨克斯风"));
		_738(67,L("低音萨克斯风"));
		_738(68,L("双簧管"));
		_738(69,L("英国管"));
		_738(70,L("巴松（大管）"));
		_738(71,L("单簧管（黑管）"));


		_6112=L("笛");
		_738(72,L("短笛"));
		_738(73,L("长笛"));
		_738(74,L("竖笛"));
		_738(75,L("排箫"));
		_738(76,L("吹瓶口"));
		_738(77,L("日本尺八"));
		_738(78,L("口哨声"));
		_738(79,L("奥卡雷那"));

		_6112=L("合成主音");
		_738(80,L("合成主音1（方波）"));
		_738(81,L("合成主音2（锯齿波）"));
		_738(82,L("合成主音3"));
		_738(83,L("合成主音4"));
		_738(84,L("合成主音5"));
		_738(85,L("合成主音6（人声）"));
		_738(86,L("合成主音7（平行五度）"));
		_738(87,L("合成主音8（贝司加主音）"));


		_6112=L("合成音色");
		_738(88,L("合成音色1（新世纪）"));
		_738(89,L("合成音色2 （温暖）"));
		_738(90,L("合成音色3"));
		_738(91,L("合成音色4 （合唱）"));
		_738(92,L("合成音色5"));
		_738(93,L("合成音色6 （金属声）"));
		_738(94,L("合成音色7 （光环）"));
		_738(95,L("合成音色8"));

		_6112=L("合成效果");
		_738(96,L("合成效果 1 雨声"));
		_738(97,L("合成效果 2 音轨"));
		_738(98,L("合成效果 3 水晶"));
		_738(99,L("合成效果 4 大气"));
		_738(100,L("合成效果 5 明亮"));
		_738(101,L("合成效果 6 鬼怪"));
		_738(102,L("合成效果 7 回声"));
		_738(103,L("合成效果 8 科幻"));


		_6112=L("民间乐器");
		_738(104,L("西塔尔（印度）"));
		_738(105,L("班卓琴（美洲）"));
		_738(106,L("三昧线（日本）"));
		_738(107,L("十三弦筝（日本）"));
		_738(108,L("卡林巴"));
		_738(109,L("风笛"));
		_738(110,L("民族提琴"));
		_738(111,L("山奈"));

		_6112=L("打击乐器");
		_738(112,L("叮当铃"));
		_738(113,L("拉丁打铃组"));
		_738(114,L("钢鼓"));
		_738(115,L("木鱼"));
		_738(116,L("太鼓"));
		_738(117,L("通通鼓"));
		_738(118,L("合成鼓"));
		_738(119,L("铜钹"));

		_6112=L("声音效果");
		_738(120,L("吉他换把杂音"));
		_738(121,L("呼吸声"));
		_738(122,L("海浪声"));
		_738(123,L("鸟鸣"));
		_738(124,L("电话铃"));
		_738(125,L("直升机"));
		_738(126,L("鼓掌声"));
		_738(127,L("枪声"));
	}
	if(_6101)
	{
		function _6113(_6114,_1267)
		{
			_1267=_6112+":  "+_1267;
			let value;
			value=(128+26)+","+_6114;
			let _1108=new Option(_1267,value);
			select.options.add(_1108);
		}
		_6112=L("鼓和其他");
		_6113(26,L("树枝折断"));
		_6113(27,L("激光枪"));
		_6113(28,L("皮鞭"));
		_6113(29,L("空中舞棍"));
		_6113(30,L("敲棒槌"));
		_6113(31,L("敲竹竿"));
		_6113(32,L("放下衣服"));
		_6113(33,L("棒子"));
		_6113(34,L("门铃"));
		_6113(35,L("声学低音鼓"));
		_6113(36,L("低音鼓1"));
		_6113(37,L("响弦鼓"));
		_6113(38,L("原声军鼓"));
		_6113(40,L("电子军鼓"));
		_6113(39,L("拍手"));
		_6113(41,L("低音落地嗵鼓"));
		_6113(43,L("高音落地嗵鼓"));
		_6113(45,L("低音嗵鼓"));
		_6113(47,L("中低音嗵鼓"));
		_6113(48,L("中高音嗵鼓"));
		_6113(50,L("高音嗵鼓"));
		_6113(42,L("闭镲"));
		_6113(44,L("踩镲"));
		_6113(46,L("开镲"));
		_6113(49,L("撞击钹1"));
		_6113(51,L("点钹"));
		_6113(52,L("中国钹"));
		_6113(55,L("溅音钹"));
		_6113(57,L("撞击钹2"));
		_6113(59,L("点钹2"));
		_6113(53,L("镲铃"));
		_6113(54,L("手铃"));
		_6113(56,L("牛铃"));
		_6113(58,L("颤音叉"));
		_6113(60,L("高音邦戈"));
		_6113(61,L("低音邦戈"));
		_6113(62,L("弱音康加鼓"));
		_6113(63,L("开康加鼓"));
		_6113(64,L("低音康加鼓"));
		_6113(65,L("高音铜鼓"));
		_6113(66,L("低音铜鼓"));
		_6113(67,L("高音拉丁打铃"));
		_6113(68,L("低音拉丁打铃"));
		_6113(69,L("卡巴沙铃"));
		_6113(70,L("砂槌"));
		_6113(71,L("短口哨"));
		_6113(72,L("长口哨"));
		_6113(73,L("短锯琴"));
		_6113(74,L("长锯琴"));
		_6113(75,L("音棒"));
		_6113(76,L("高音敲木块"));
		_6113(77,L("低音敲木块"));
		_6113(78,L("弱音鸟鸣桶"));
		_6113(79,L("开音鸟鸣桶"));
		_6113(80,L("弱音三角铁"));
		_6113(81,L("开三角铁"));
		_6113(82,L("扫地"));
		_6113(83,L("一串铜钱"));
		_6113(84,L("梦幻"));
		_6113(85,L("塑料块掉地上"));
		_6113(86,L("破鼓"));
		_6113(87,L("怪音鼓"));
	}
}
function _6115(_6116,_6117,_6118)
{
	let _6119;
	_6119 = _6116._1107();
	let options;
	options=_6119.options;
	for(let _754=0;_754<options.length;_754++)
	{
		let _1108;
		_1108=options[_754];
		if(_1108.value==_6117)
			_1108.text="★ "+_1108.text;
		else if(_1108.value==_6118)
			_1108.text="☆ "+_1108.text;
	}
}




function _6120(_987, _6116)
{
	let _6119 = _6116._1107();
	let value;
	value=_6119.options[_6119.selectedIndex].value;
	if(value.indexOf(",")!=-1)
	{
		value=value.split(",");
		value=value[0];
		_987._6073=parseInt(value);
	}
	else
		_987._6073=parseInt(value);
	let _984;
	_984=document.getElementById(_6119.id+"_984");
	_987._6121=_984.value;
}
function _6122(_6116)
{
	_6119 = _6116._1107();
	let value;
	value=_6119.options[_6119.selectedIndex].value;
	if(value.indexOf(",")==-1)
		return -1;
	return parseInt(value.split(",")[1]);
}
function _6108(_406)
{
	let _6119;
	_6119 = _406._2849._1107();
	let _1291;
	_1291 = _6119.value;
	_6109(_1291);
}
function _6109(_1291)
{
	if (_1291 == "")
		return;
	let _6123;
	_6123 = new _1288();
	_6123._1029(88);
	if (_1291.indexOf(",") != -1)
	{
		
		_6123._1290(_1291, 0x3c, 1, 1, 0);
	}
	else
	{
		
		_6123._1290(_1291, 0x3c - 12, 0.5, 1, -1);
		_6123._1290(_1291, 0x3c, 0.5, 1, -1);
		_6123._1290(_1291, 0x3c + 12, 1, 1, -1);
		_6123._1290(_1291, 0x3c, 0.5, 1, -1);
		_6123._1290(_1291, 0x3c + 2, 0.5, 1, -1);
		_6123._1290(_1291, 0x3c + 4, 1, 1, -1);
    }

	if(parent)
		parent._937(_6123._893);
}
function _582(_6104)
{
	for (let _570 = 0; _570 < arguments.length; _570++)
	{
		let _5346;
		_5346 = arguments[_570];
		if (_5346._3289 && _5346._3289 == "_7859")
		{
			_5346.disabled = null;
			let _6108;
			_6108 = document.getElementById(_5346.id + "_6108");
			_6108.disabled = null;
			let _984;
			_984 = document.getElementById(_5346.id + "_984");
			_984._967(true);
			if (_5346.id == "prelude_instrument_1")
				_6124._967(true);
			else if (_5346.id == "prelude_instrument_2")
				_6125._967(true);
			else if (_5346.id == "postlude_instrument_1")
				_6126._967(true);
			else if (_5346.id == "postlude_instrument_2")
				_6127._967(true);
		}
		else
			_5346.disabled = null;
	}
}
function _6128(_6104)
{
	for (let _570 = 0; _570 < arguments.length; _570++)
	{
		let _5346;
		_5346 = arguments[_570];
		if (_5346._3289 && _5346._3289 == "_7859")
		{
			_5346.disabled = "disabled";
			let _6108;
			_6108 = document.getElementById(_5346.id + "_6108");
			_6108.disabled = "disabled";
			let _984;
			_984 = document.getElementById(_5346.id + "_984");
			_984._967(false);
			if (_5346.id == "prelude_instrument_1")
				_6124._967(false);
			else if (_5346.id == "prelude_instrument_2")
				_6125._967(false);
			else if (_5346.id == "postlude_instrument_1")
				_6126._967(false);
			else if (_5346.id == "postlude_instrument_2")
				_6127._967(false);
		}
		else
			_5346.disabled = "disabled";
	}
}
function _6129(_6130)
{
	let _6131;
	_6131=document.body.getElementsByTagName("input");
	for(let _570=0;_570<_6131.length;_570++)
	{
		let _949;
		_949=_6131[_570];
		if(_949.type!="button")
			continue;
		if(_949.value!=L("试听"))
			continue;
		if(_6130)
			_582(_949);
		else
			_6128(_949);
	}
}
function _1759(_6132)
{

}
function _1764(_6133)
{

}
function _1208()
{
	_6129(true);
}
function _866()
{
	_6129(false);
}

function _590()
{
	let _985=new Object();
	_6134._590(_985);
	
	return JSON.stringify(_985,null,"\t");
}
function _587(_893)
{
	let _985;
	_985 = JSON.parse(_893);
	_6134._6135 = -1;
	_6134._587(_985);
	_6136();
	_6137();
}
function _1029()
{
	if(parent)
	{
		if(parent._940())
			_6129(true);
		else
			_6129(false);
	}
}
function _1162()
{
	_6089();
	_6136();
}
function _597()
{

}
