class _3013
{
	_1784 = "a";
	_1785 = "";
	_3014 = 0;
	_3015 = 0.1358;
	_1786 = "";
	_1787 = "a";
	_1788 = "";
	_3016 = 0;
	_3017 = 1000;

	
	_3018 = 0.3;
	_3019 = -0.1;
	_3020 = -0.3;
	_3021 = 0.1;

	
	
	
	
	
	_3022;
	_3023;
	_3024;

	_3025 = false;
	_3026 = false;
	
	
	
	
	_3027 = 0;

	
	_1781 = false;
	_3028 = -1;

	_3029 = 0;

	_3030;
	_3031;
	_3032;
	_3033;

	
	
	
	
	
	_3034 = new _3035();
	

	_3036 = false;
	_3037 = false;

	_2314(_305)
	{
		for (let key in this)
			if (this[key] != this._3034)
				this[key] = _305[key];
		this._3034._2314(_305._3034);
	}
	_3038(_305, _1779)
	{
		
		if (_1779)
			if (_305._3028 == -1)
				return;
		
		this._3017 = _305._3017;
		this._3018 = _305._3018;
		this._3019 = _305._3019;
		this._3020 = _305._3020;
		this._3021 = _305._3021;
		this._3028 = _305._3028;
		if (
			this._3039() == _305._3039() &&
			this._3040() == _305._3040() &&
			this._3041() == _305._3041() &&
			this._3042() == _305._3042()
		)
			this._3034._2314(_305._3034);
	}

	_3043()
	{
		return this._3034._3044 == 1;
	}

	_3045()
	{
		return _1665._3046(this._3022);
	}

	_3047()
	{
		if (this._3048())
			return true;
		if (this._3022 == "普通声带音" || this._3022 == "_7754" || this._3022 == "浊辅音过度到元音" || this._3022 == "_5802" || this._3022 == "英语bglr过度音" || this._3022 == "浊辅音" || this._3022 == "清辅音后的浊辅音" || this._3022 == "爆破声带音" || this._3022 == "英语bglr爆破音" || this._3022 == "送气破擦音后部" || this._3022 == "不送气破擦音后部")
			return false;
		return true;
    }

	_3048()
	{
		if (this._3022 == "过度声带音" || this._3022 == "过度到浊辅音前声带音" || this._3022 == "_7755")
			if (this._1781)
				return true;
		return false;
	}

	_3039()
	{
		if (this._3022 == "爆破清音" || this._3022 == "英语bglr清擦音" || this._3022 == "清摩擦音" || this._3022 == "破擦音" || this._3022 == "_7756" || this._3022 == "_7757")
			return true;
		if (this._3022 == "浊辅音" && _1665._3049(this._1784) && _1665._3050(this._1784))
			return true;
		return false;
	}
	_3040()
	{
		if (this._3022 == "浊辅音" && _1665._3049(this._1784) && (!_1665._3050(this._1784)))
			return true;
		if (this._3022 == "爆破声带音" && (_1665._3051(this._1784) || _1665._3052(this._1784) || _1665._3053(this._1784) ))
			return true;
		return false;
	}
	_3041()
	{
		if (this._3022 == "浊辅音前声带音")
			if (this._3043())
				return true;
		return false;
	}
	_3042()
	{
		if (this._3022 == "浊辅音前声带音")
			if (!this._3043())
				return true;
		return false;
	}
}
class _3054
{
	_3055 = new _3056();
	_3057 = new _3058();
	_1776 = new Array();
	_1777 = new Array();
	_1778 = new Array();
	_1780 = new _3013();
	constructor()
	{
		this._1780._3022 = "过度声带音";
		this._1780._1781 = false;
	}
	_2314(_1772)
	{
		function _3059(_3060, _1869)
		{
			_3060.length = _1869.length;
			for (let _754 = 0; _754 < _3060.length; _754++)
			{
				let _1102 = new _3013();
				_3060[_754] = _1102;
				let _1103;
				_1103 = _1869[_754];
				_1102._2314(_1103);
			}
		}
		_3059(this._1776, _1772._1776);
		_3059(this._1777, _1772._1777);
		_3059(this._1778, _1772._1778);
		this._1780._2314(_1772._1780);
	}
	_3038(_1772)
	{
		function _3061(_3060, _1869)
		{
			let _1013;
			_1013 = Math.min(_3060.length, _1869.length);
			for (let _754 = 0; _754 < _1013; _754++)
			{
				let _1102 = _3060[_754];
				let _1103;
				_1103 = _1869[_754];
				_1102._3038(_1103,false);
			}
		}
		_3061(this._1776, _1772._1776);
		_3061(this._1777, _1772._1777);
		_3061(this._1778, _1772._1778);
		this._1780._3038(_1772._1780,true);
	}
	_3062()
	{
		let _1236 = [...this._1776, ...this._1777, ...this._1778];
		if (_1236.length == 0)
			return null;
		return _1236[0];
	}
	_3063()
	{
		let _1236 = [...this._1776, ...this._1777, ...this._1778];
		if (_1236.length == 0)
			return null;
		return _1236[_1236.length - 1];
    }
	_3064()
	{
		if (this._1780._1781)
			return this._1780;
		return this._3063();
	}
}

