class _2643
{
	_2319 = false;
	
	_2660 = false;
	_2617 = false;
	_2661 = false;
	_2619 = false;
	_2620 = false;
	_2804 = F("半拍");

	_2314(_2742)
	{
		_581._1324(this, _2742);
	}
	_6731()
	{
		let _3150 = new _1209();
		_3150._1235();
		_3150._1241(F("节拍结束"),this._2319);
		_3150._1241(F("前面的音节音高高"),this._2660);
		_3150._1241(F("前面的音节音量大"),this._2617);
		_3150._1241(F("第一个音节是爆破音较重或者送气清擦音较重"),this._2661);
		_3150._1241(F("最后一个音节时值长"),this._2619);
		_3150._1241(F("最后一个音节结束后停顿"),this._2620);
		_3150.String(F("节拍持续时长"),this._2804);
		return _3150._1260();
	}
	_6744(_893)
	{
		let _985 = JSON.parse(_893);
		let _623;
		_623 = _985[F("节拍结束")]; if (_623 !== undefined) this._2319 = _623;
		_623 = _985[F("前面的音节音高高")]; if (_623 !== undefined) this._2660 = _623;
		_623 = _985[F("前面的音节音量大")]; if (_623 !== undefined) this._2617 = _623;
		_623 = _985[F("第一个音节是爆破音较重或者送气清擦音较重")]; if (_623 !== undefined) this._2661 = _623;
		_623 = _985[F("最后一个音节时值长")]; if (_623 !== undefined) this._2619 = _623;
		_623 = _985[F("最后一个音节结束后停顿")]; if (_623 !== undefined) this._2620 = _623;
		_623 = _985[F("节拍持续时长")]; if (_623 !== undefined) this._2804 = _623;
	}
}
class _1633
{
	_1634=0x3c;
	_1635=0.5;
	_2426 = 0.09375;
	_2427 = 0.09375;

	
	_6716 = true;
	_6575 = 0;
	_6576 = 0.09375;
	_6717 = true;
	_6577 = 0.09375;
	_6578 = 0;

	_1637 = false;
	
	
	_6527 = new Array();
	_5992 = new _2643();
	_1621 = new _2944();
	
	
	_6715(_455)
	{
		this._6527.length = _455._6527.length;
		for (let _754 = 0; _754 < this._6527.length; _754++)
			this._6527[_754] = _455._6527[_754];
	}
	_2314(_455)
	{
		for (let key in this)
		{
			if (this[key] == this._6527)
				this._6715(_455);
			else if (this[key] == this._6991)
				this._6991._2314(_455._6991);
			else
				this[key] = _455[key];
		}
	}
	_5409()
	{
		if (this._1637)
			return false;
		return this._1621._1622;
	}
	_5408()
	{
		return this._1637;
	}
	_6558()
	{
		if (this._1637)
			return "";
		return this._1621._1641;
	}
	_6555()
	{
		if (this._1637)
			return L("⌒");
		let _569;
		_569 = this._1621._1640;
		_569 += this._1621._1688();
		return _569;
	}
	_1636()
	{
		let _2381;
		_2381 = this._1635;
		if (this._2426 + this._2427 > _2381 * 0.7)
		{
			let _6992, _6993;
			_6992 = this._2426;
			_6993 = this._2427;
			let _6994;
			_6994 = _6992 + _6993;
			this._2426 = _2381 * 0.7 * _6992 / _6994;
			this._2427 = _2381 * 0.7 * _6993 / _6994;
		}
		if (this._6575 + this._6576 + this._6577 + this._6578 > _2381)
		{
			let _6995, _6996, _6997, _6998;
			_6995 = this._6575;
			_6996 = this._6576;
			_6997 = this._6577;
			_6998 = this._6578;
			let _6994;
			_6994 = (_6995 + _6996 + _6997 + _6998);
			this._6575 = _2381 * _6995 / _6994;
			this._6576 = _2381 * _6996 / _6994;
			this._6577 = _2381 * _6997 / _6994;
			this._6578 = _2381 * _6998 / _6994;
		}
	}
}
function _6794()
{
	if (!_581._1334())
		return new _1633();
	return parent._6794();
}

